[
  {
    "id": 1,
    "title": "The Holiday Delights - Đại Tiệc Cuối Năm Tại Hoiana Resort & Golf",
    "description": "Đến với podcast này, chúng ta sẽ cùng nhau khám phá chương trình đặc biệt mùa lễ hội tại khu nghỉ dưỡng phức hợp hàng đầu tại Hội An – Hoiana Resort & Golf.",
    "content": "<h1>Hoiana Resort & Golf - Mùa lễ hội tháng 12</h1>\n<p>Cùng với ông <strong>Jimmy Lopez</strong> - Tổng Quản Lý Khối Khách Sạn Hoiana - thuộc khu phức hợp nghỉ dưỡng Hoiana Resort &amp; Golf, chúng ta sẽ vén màn những hoạt động vô cùng đặc sắc tại đây chỉ diễn ra đúng vào mùa lễ hội này.</p>\n<h2>Danh sách hoạt động</h2>\n<ul>\n<li>Lễ hội thắp sáng cây thông Giáng Sinh cao 10 mét tại sảnh đón khách.</li>\n<li>Buổi tiệc buffet thịnh soạn với đa dạng tinh hoa ẩm thực từ nhiều nước trên thế giới.</li>\n<li>Menu độc nhất cho mùa lễ hội tại toàn bộ nhà hàng, quầy bar và lounge cao cấp.</li>\n<li>Đêm countdown chào năm mới với màn bắn pháo hoa mãn nhãn.</li>\n</ul>\n<p>Theo ông Jimmy Lopez chia sẻ, toàn bộ nhà hàng và quầy bar, lounge cao cấp tại Hoiana sẽ sáng tạo menu độc nhất cho mùa lễ hội năm nay, hứa hẹn mang đến những trải nghiệm đáng nhớ cho khách du lịch tại Hoiana Resort &amp; Golf.</p>\n<p>Và đừng bỏ lỡ đêm countdown đón chào năm mới tại Hoiana với màn bắn pháo hoa cực kỳ mãn nhãn, được đầu tư chỉn chu nhằm mang đến không khí lễ hội tầm cỡ.</p>\n<p>Cùng khám phá tất cả hoạt động thú vị, hấp dẫn nhưng không thiếu sự sang trọng, đẳng cấp đến từ Hoiana Resort &amp; Golf nhé.</p>",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://youtu.be/fH7OJbrvQvA?si=YezVXIEGfgLEgjO4",
    "thumbnailUrl": "/assets/images/img1_.jpg",
    "authorId": 1,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-01-15T10:00:00Z",
    "updatedAt": "2024-01-16T10:00:00Z"
  },
  {
    "id": 2,
    "title": "Nhân sự dần sẽ bị đào thải nếu không biết tận dụng AI?",
    "description": "Khám phá AI trong năm 2025",
    "content": "Khái niệm AI (trí tuệ nhân tạo) không còn quá xa lạ với người dùng phổ thông trong năm 2024. Các công cụ chatbot AI dần trở nên phổ biến và cần thiết hơn bao giờ hết cho mọi ngành nghề, không chỉ mỗi lập trình viên hay sáng tạo nội dung. Đặc biệt, 2025 hứa hẹn sẽ trở nên bùng nổ khi xuất hiện càng nhiều các phần cứng hỗ trợ AI.\n\nCụ thể, khái niệm Copilot+PC ra đời khi Intel cho ra mắt vi xử lý Intel Core Ultra 200V. Đây là CPU có khả năng tiết kiệm điện năng cao, hỗ trợ máy học và trí tuệ nhân tạo.\n\nVới vi xử lý mới của Intel, việc xử lý prompt hay tác vụ AI sẽ trở nên nhẹ nhàng hơn, Tuấn Ngọc chia sẻ. Theo đó, CPU sẽ xử lý sẵn mọi dữ liệu trực tiếp trên máy, từ đó đưa lên máy chủ để AI generate nhanh hơn, đưa ra kết quả kịp thời và chính xác.",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://youtu.be/APsNhGmFIKw?si=WPfMdY7PWp7TDChm",
    "thumbnailUrl": "/assets/images/img3_.jpg",
    "authorId": 1,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-01-10T14:30:00Z",
    "updatedAt": "2024-01-11T14:30:00Z"
  },
  {
    "id": 3,
    "title": "Lý do ẩm thực tại Hoiana được đánh giá cao tuyệt đối ?!",
    "description": "Tập podcast trò chuyện cùng ông Jimmy Lopez, Tổng Quản Lý Khối Khách Sạn Hoiana Resort & Golf, khám phá 'Taste of Hoiana' với hành trình ẩm thực độc đáo từ Á sang Âu, đội ngũ bếp tài năng quốc tế và không gian sang trọng tại Nox Beach Club.",
    "content": "Trong tập podcast lần này, chúng ta sẽ có dịp trò chuyện cùng ông Jimmy Lopez, Tổng Quản Lý Khối Khách Sạn Hoiana thuộc khu phức hợp nghỉ dưỡng Hoiana Resort & Golf, để khám phá thế giới ẩm thực đặc sắc tại đây.\n\nTheo ông Jimmy, \"Taste of Hoiana\" là một chương trình đặc biệt được thiết kế để mang đến cho khách hàng những trải nghiệm ẩm thực độc đáo, từ các món ăn Á Đông tinh tế đến ẩm thực châu Âu sang trọng.\n\nVới sự đa dạng về quốc tịch của khách hàng, việc mở rộng nền ẩm thực tại khu nghỉ dưỡng trở thành một yếu tố quan trọng. Khách hàng không chỉ muốn nghỉ dưỡng mà còn tìm kiếm cơ hội để khám phá những hương vị mới lạ đến từ nhiều nền văn hóa khác nhau.\n\nMột điểm nhấn đặc biệt tại Hoiana Resort & Golf chính là đội ngũ bếp tài năng với các đầu bếp đến từ khắp nơi trên thế giới như Hàn Quốc, Ý, và Trung Quốc. Tại đây, họ không chỉ tạo ra những món ăn đặc trưng của từng quốc gia mà còn khéo léo biến tấu, \"customize\" các món ăn truyền thống để phù hợp hơn với khẩu vị và kỳ vọng của khách hàng.\n\nNgoài ra, khu nghỉ dưỡng còn sở hữu Nox Beach Club – nơi lý tưởng để thực khách vừa thưởng thức các món hải sản tươi ngon, thịt cao cấp theo tiêu chuẩn đẳng cấp, vừa nhâm nhi cocktails bên bãi biển. Đây thực sự là không gian hoàn hảo để tận hưởng những khoảnh khắc thư giãn và sang trọng.\n\nHãy cùng chúng tôi khám phá thêm về những trải nghiệm ẩm thực độc đáo và tinh tế tại Hoiana Resort & Golf qua tập podcast này nhé!",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://youtu.be/46r-1EBGkcI?si=JgyOMDxG0HqgPLGj",
    "thumbnailUrl": "/assets/images/img4_.jpg",
    "authorId": 1,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-01-05T09:15:00Z",
    "updatedAt": "2024-01-06T09:15:00Z"
  },
  {
    "id": 4,
    "title": "Phim ngắn Tết: NHÀ | Samsung ft. Thegioididong",
    "description": "Thông điệp Tết ấm áp từ Samsung và Thegioididong, gửi gắm yêu thương, trân trọng khoảnh khắc bên gia đình và hy vọng vào một năm mới bình yên.",
    "content": "Sau tất cả những tàn dư còn sót lại của một năm, có lẽ tia sáng chúng ta mong đợi nhất là được trở về nương mình bên gia đình thân yêu. Như hoàng hôn vào ngày tàn, như cái ôm ngày mai sang...\nƯớc gì sau tất cả những buồn lo, những trăn trở, bạn cũng sẽ nhìn thấy được ánh sáng hy vọng của riêng mình, NHÀ, nơi luôn chấp nhận và yêu thương bạn vô điều kiện dẫu bạn là ai, nơi mà chỉ cần được nhìn thấy bạn thôi cũng đủ thấy an lòng.\nVà dù bạn có lựa chọn như thế nào, cũng nguyện chúc bạn một năm mới thật bình yên và ấm áp, vì chỉ cần là còn nhau, thì dù cách xa muôn trùng, mình vẫn sẽ còn có Tết.\nCùng Samsung và Thegioididong trao yêu thương và gửi gắm lời nhắn nhủ: Tết này, cảm ơn, vì còn được nhìn thấy nhau!\nVì cuộc đời còn đẹp, mình còn có ngày mai!!!",
    "tags": ["youtube"],
    "videoUrl": "https://youtu.be/eoIeGgdffws?si=ySgAAuTIR37y8NXC",
    "thumbnailUrl": "/assets/images/img5_.jpg",
    "authorId": 2,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-02-01T08:00:00Z",
    "updatedAt": "2024-02-02T08:00:00Z"
  },
  {
    "id": 5,
    "title": "Cùng Samsung Care+ Nhẹ gánh lo đi và an tâm trải nghiệm",
    "description": "Samsung Care+ mang đến sự an tâm trọn vẹn, giúp bạn tận hưởng thiết bị mà không lo rủi ro.",
    "content": "Cùng Samsung Care+ nhẹ gánh mọi lo lắng về hư hỏng, rơi vỡ hay sự cố ngoài ý muốn, để bạn an tâm trải nghiệm thiết bị mỗi ngày. Từ bảo vệ toàn diện đến dịch vụ hỗ trợ nhanh chóng, Samsung Care+ luôn đồng hành, giúp bạn tận hưởng trọn vẹn công nghệ mà không bị gián đoạn.",
    "tags": ["tiktok"],
    "videoUrl": "https://youtu.be/4ni3oTUxecI?si=s6uI39TGI0iMGiHJ",
    "thumbnailUrl": "/assets/images/img6_.jpg",
    "authorId": 2,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-02-10T12:00:00Z",
    "updatedAt": "2024-02-11T12:00:00Z"
  },
  {
    "id": 6,
    "title": "Thấy Nhau Là Có Tết! Rồi Con Sẽ Về?",
    "description": "Thế Giới Di Động giúp bạn kết nối người thân để đón một cái Tết sum vầy và ý nghĩa.",
    "content": "Nhìn lại một năm đã qua với không ít khó khăn, người thì tất bật chuẩn bị cho một mùa Tết đủ đầy, nhưng với người khác, được sum vầy bên gia đình đã là cả một ước mơ. Dù gần hay xa, chỉ cần được nhìn thấy nhau bình an, mạnh khỏe, ấy chính là Tết. Hãy để Thế Giới Di Động kết nối bạn với những người thân yêu, mang đến cái Tết đúng nghĩa và trọn vẹn yêu thương cho mọi miền.",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://youtu.be/-mUizB8I-Bc?si=hTEq5dygXbmySUSk",
    "thumbnailUrl": "/assets/images/img7_.jpg",
    "authorId": 3,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-03-01T15:00:00Z",
    "updatedAt": "2024-03-02T15:00:00Z"
  },
  {
    "id": 7,
    "title": "NHÌN LẠI MỘT NĂM ĐẶC BIỆT.......!!!",
    "description": "Cùng Galaxy Z khép lại năm cũ và chào đón năm mới đầy hy vọng và niềm vui.",
    "content": "Năm vừa qua là một hành trình đầy khó khăn và thử thách, để lại những ký ức mà chúng ta sẽ không bao giờ quên. Dù mọi điều đã xảy ra, hãy giữ vững hy vọng về một ngày mai tươi sáng, một cuộc sống năng động và một năm mới tràn đầy niềm vui. Thành công hay thất bại đều chỉ là chuyện của năm cũ, hãy cùng Galaxy Z khép lại quá khứ và đón chào tương lai tốt đẹp hơn.",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://youtu.be/6VKuSEXDvuo?si=DC3OlvYEH0GSWyZL",
    "thumbnailUrl": "/assets/images/img8_.jpg",
    "authorId": 3,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-03-15T10:30:00Z",
    "updatedAt": "2024-03-16T10:30:00Z"
  },
  {
    "id": 8,
    "title": "Huawei Watch Fit: Siêu MỎNG NHẸ, giá RẺ VÔ ĐỊCH, tự tin khoe cá tính",
    "description": "Smartwatch siêu mỏng nhẹ, giá cực tốt, đầy đủ tính năng sức khỏe và thể thao.",
    "content": "Huawei Watch Fit – chiếc smartwatch siêu mỏng nhẹ với thiết kế thời trang, thoải mái đeo cả ngày mà không gây vướng víu. Trang bị đầy đủ tính năng theo dõi sức khỏe, luyện tập thể thao và hiển thị thông báo thông minh, chiếc đồng hồ này vẫn có mức giá cực kỳ dễ tiếp cận. Đây chính là lựa chọn lý tưởng để bạn tự tin thể hiện cá tính mà không lo về chi phí.",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://youtu.be/PJaarUnqxr4?si=ydh4zAAVkbHCEXGn",
    "thumbnailUrl": "/assets/images/img9_.jpg",
    "authorId": 4,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-04-01T09:00:00Z",
    "updatedAt": "2024-04-02T09:00:00Z"
  }
]
