[
  {
    "id": 1,
    "title": "Khám Phá Thế Giới Three.js: Tạo Trải Nghiệm 3D Tuyệt Vời",
    "description": "Hướng dẫn toàn diện về việc tạo ra những ứng dụng web 3D ấn tượng với Three.js và WebGL",
    "content": "<h2>Giới thiệu về Three.js</h2><p>Three.js là một thư viện JavaScript mạnh mẽ giúp tạo ra những trải nghiệm 3D tuyệt vời trên web. Với Three.js, bạn có thể xây dựng từ những game đơn giản đến những ứng dụng 3D phức tạp.</p><h2>Bắt đầu với Three.js</h2><p>Để bắt đầu với Three.js, bạn cần hiểu ba thành phần cơ bản: Scene, Camera và Renderer. Đây là nền tảng của mọi ứng dụng Three.js.</p><p>Scene là không gian 3D nơi bạn đặt các đối tượng. Camera xác định góc nhìn của người dùng. Renderer chịu trách nhiệm vẽ scene lên canvas.</p><h2>Tạo hình học và vật liệu</h2><p>Three.js cung cấp nhiều loại hình học có sẵn như BoxGeometry, SphereGeometry, PlaneGeometry. Bạn cũng có thể tạo hình học tùy chỉnh hoặc import từ các phần mềm 3D như Blender.</p><p>Vật liệu quyết định cách bề mặt của đối tượng phản ứng với ánh sáng. MeshBasicMaterial không bị ảnh hưởng bởi ánh sáng, trong khi MeshLambertMaterial và MeshPhongMaterial có thể tạo ra hiệu ứng ánh sáng phức tạp hơn.</p>",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "/assets/textures/kda.mp4",
    "thumbnailUrl": "/assets/images/img1_.jpg",
    "authorId": 1,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-01-15T10:00:00Z",
    "updatedAt": "2024-01-16T10:00:00Z"
  },
  {
    "id": 2,
    "title": "Thiết Kế UI/UX Minimal: Nghệ Thuật Của Sự Đơn Giản",
    "description": "Khám phá triết lý thiết kế minimal và cách áp dụng vào dự án thực tế",
    "content": "<h2>Triết lý Minimal Design</h2><p>Thiết kế minimal không chỉ là việc loại bỏ các yếu tố thừa thải, mà là nghệ thuật của việc giữ lại những gì thực sự cần thiết. 'Less is more' - câu nói nổi tiếng của Ludwig Mies van der Rohe vẫn còn nguyên giá trị trong thiết kế hiện đại.</p><h2>Nguyên tắc cơ bản</h2><p>Minimal design dựa trên những nguyên tắc cốt lõi: không gian trắng, typography rõ ràng, bảng màu hạn chế, và tập trung vào nội dung. Mỗi yếu tố trong thiết kế phải có lý do tồn tại.</p><p>Không gian trắng (whitespace) không phải là không gian trống, mà là yếu tố thiết kế tích cực giúp tạo ra sự cân bằng và hướng dẫn mắt người dùng.</p><h2>Áp dụng vào Web Design</h2><p>Trong web design, minimal approach giúp cải thiện tốc độ tải trang, tăng khả năng sử dụng và tạo ra trải nghiệm người dùng mượt mà. Grid system đơn giản, navigation rõ ràng và call-to-action nổi bật là những yếu tố quan trọng.</p>",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://www.example.com/videos/sample-video.mp4",
    "thumbnailUrl": "/assets/images/img3_.jpg",
    "authorId": 1,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-01-10T14:30:00Z",
    "updatedAt": "2024-01-11T14:30:00Z"
  },
  {
    "id": 3,
    "title": "React Performance Optimization: Tối Ưu Hiệu Suất Ứng Dụng",
    "description": "Những kỹ thuật và best practices để tối ưu hiệu suất ứng dụng React",
    "content": "<h2>Tại sao Performance quan trọng?</h2><p>Performance là yếu tố quyết định trải nghiệm người dùng. Một ứng dụng React chậm chạp không chỉ làm người dùng khó chịu mà còn ảnh hưởng đến SEO và conversion rate.</p><h2>React.memo và useMemo</h2><p>React.memo giúp tránh re-render không cần thiết cho functional components. useMemo được sử dụng để memoize expensive calculations. Tuy nhiên, cần sử dụng đúng cách để tránh over-optimization.</p><h2>Code Splitting và Lazy Loading</h2><p>Code splitting cho phép chia nhỏ bundle thành các chunks nhỏ hơn, giúp giảm thời gian load ban đầu. React.lazy và Suspense là những công cụ mạnh mẽ cho việc này.</p><p>Lazy loading images và components giúp cải thiện performance đáng kể, đặc biệt cho những trang có nhiều nội dung.</p>",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "https://www.example.com/videos/sample-video.mp4",
    "thumbnailUrl": "/assets/images/img4_.jpg",
    "authorId": 1,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-01-05T09:15:00Z",
    "updatedAt": "2024-01-06T09:15:00Z"
  },
  {
    "id": 4,
    "title": "Xây Dựng RESTful API Với Node.js & Express",
    "description": "Hướng dẫn từng bước xây dựng RESTful API chuyên nghiệp bằng Node.js và Express",
    "content": "<h2>Giới thiệu về RESTful API</h2><p>RESTful API là chuẩn giao tiếp phổ biến giữa client và server. Node.js cùng Express giúp việc xây dựng API trở nên nhanh chóng và hiệu quả.</p><h2>Các bước cơ bản</h2><p>Bắt đầu với việc khởi tạo project, cài đặt Express, định nghĩa các route và xử lý request/response. Đừng quên áp dụng middleware cho bảo mật và logging.</p><h2>Kết nối Database</h2><p>Sử dụng Mongoose để kết nối MongoDB, định nghĩa schema và thao tác dữ liệu dễ dàng.</p>",
    "tags": ["youtube"],
    "videoUrl": "/assets/videos/node-express.mp4",
    "thumbnailUrl": "/assets/images/img5_.jpg",
    "authorId": 2,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-02-01T08:00:00Z",
    "updatedAt": "2024-02-02T08:00:00Z"
  },
  {
    "id": 5,
    "title": "Tạo Portfolio Cá Nhân Với Next.js",
    "description": "Xây dựng website portfolio hiện đại, tối ưu SEO với Next.js",
    "content": "<h2>Giới thiệu Next.js</h2><p>Next.js là framework React mạnh mẽ hỗ trợ SSR và SSG, giúp tối ưu SEO và tốc độ tải trang.</p><h2>Các bước xây dựng</h2><p>Khởi tạo project, tạo các page, sử dụng getStaticProps để lấy dữ liệu tĩnh, và triển khai lên Vercel.</p><h2>Tối ưu SEO</h2><p>Sử dụng Head component để thêm meta tags, tối ưu hình ảnh với next/image.</p>",
    "tags": ["tiktok"],
    "videoUrl": "/assets/videos/nextjs-portfolio.mp4",
    "thumbnailUrl": "/assets/images/img6_.jpg",
    "authorId": 2,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-02-10T12:00:00Z",
    "updatedAt": "2024-02-11T12:00:00Z"
  },
  {
    "id": 6,
    "title": "Quản Lý State Hiệu Quả Với Redux Toolkit",
    "description": "Tìm hiểu cách sử dụng Redux Toolkit để quản lý state phức tạp trong ứng dụng React",
    "content": "<h2>Redux Toolkit là gì?</h2><p>Redux Toolkit đơn giản hóa việc setup và sử dụng Redux, giảm boilerplate code.</p><h2>Các khái niệm chính</h2><p>Slice, store, async thunk giúp tổ chức code rõ ràng, dễ bảo trì.</p><h2>Best Practices</h2><p>Chia nhỏ slice, sử dụng selector và middleware để tối ưu hiệu suất.</p>",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "/assets/videos/redux-toolkit.mp4",
    "thumbnailUrl": "/assets/images/img7_.jpg",
    "authorId": 3,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-03-01T15:00:00Z",
    "updatedAt": "2024-03-02T15:00:00Z"
  },
  {
    "id": 7,
    "title": "Triển Khai CI/CD Cho Dự Án Frontend",
    "description": "Tự động hóa build, test và deploy dự án frontend với GitHub Actions",
    "content": "<h2>CI/CD là gì?</h2><p>Continuous Integration và Continuous Deployment giúp phát triển phần mềm nhanh, ổn định hơn.</p><h2>Thiết lập GitHub Actions</h2><p>Tạo workflow tự động build, test và deploy lên môi trường production.</p><h2>Lợi ích</h2><p>Giảm lỗi thủ công, tăng tốc độ release và đảm bảo chất lượng sản phẩm.</p>",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "/assets/videos/cicd-frontend.mp4",
    "thumbnailUrl": "/assets/images/img8_.jpg",
    "authorId": 3,
    "isPublished": true,
    "isFeatured": false,
    "createdAt": "2024-03-15T10:30:00Z",
    "updatedAt": "2024-03-16T10:30:00Z"
  },
  {
    "id": 8,
    "title": "Ứng Dụng Machine Learning Với Python Cơ Bản",
    "description": "Khám phá các bước xây dựng ứng dụng machine learning đầu tiên với Python và scikit-learn",
    "content": "<h2>Giới thiệu Machine Learning</h2><p>Machine learning giúp máy tính học từ dữ liệu để dự đoán hoặc phân loại.</p><h2>Các bước cơ bản</h2><p>Tiền xử lý dữ liệu, chọn mô hình, huấn luyện và đánh giá kết quả với scikit-learn.</p><h2>Demo</h2><p>Xây dựng mô hình phân loại đơn giản với dataset Iris.</p>",
    "tags": ["youtube", "tiktok"],
    "videoUrl": "/assets/videos/ml-python.mp4",
    "thumbnailUrl": "/assets/images/img9_.jpg",
    "authorId": 4,
    "isPublished": true,
    "isFeatured": true,
    "createdAt": "2024-04-01T09:00:00Z",
    "updatedAt": "2024-04-02T09:00:00Z"
  }
]
